app/Controllers/AbsenController.php

INSERT INTO `absen` (`id_user`, `tanggal_absen`, `id_kelas`) VALUES ('8', '2025-11-21 02:51:45', '1')
SELECT *
FROM `kelas`
WHERE `kelas`.`id` = '1'
UPDATE `users` SET `point` = 40, `updated_at` = '2025-11-21 02:51:45'
WHERE `users`.`id` IN ('8')
---
        }

        // insert absen
        $this->Absen->save([
            'id_user' => user()->id,
            'tanggal_absen' => date('Y-m-d H:i:s'),
            'id_kelas' => $dataqr['kelasId']
        ]);

        $kelas = $this->Kelas->find($dataqr['kelasId']);

        $this->userModel->update(user()->id , [
            'point' => user()->point + $kelas['point']
        ]);