app/Controllers/Home.php

SELECT *
FROM `rewards`
---
    public function rewards()
    {
        $data = [
            'user' => user(),
            'rewards' => $this->Rewards->findAll()
        ];

SELECT *
FROM `absen`
---
    public function absen()
    {
        $data = [
            'user' => user(),
            'absen' => $this->Absen->findAll()
        ];

SELECT `id_kelas`, `id_user`
FROM `detail_kelas`
WHERE `id_user` = '8'
SELECT *
FROM `kelas`
---
    public function kelas()
    {
        $dataKelas = $this->DetailKelas->where('id_user' , user()->id)->select('id_kelas , id_user')->findAll();
        $data = [
            'user' => user(),
            'kelas' => $this->Kelas->findAll(),
            'detail_kelas' => $dataKelas ?? 0
        ];

SELECT *
FROM `progress`
WHERE `id_user` = '8'
AND DATE(tanggal_gabung) = '2025-11-24'
 LIMIT 1
SELECT `progress`.*, `kelas`.`nama_kelas`
FROM `progress`
JOIN `kelas` ON `kelas`.`id` = `progress`.`id_kelas`
WHERE `progress`.`id_user` = '8'
ORDER BY `progress`.`id` ASC
---
    public function analitik()
    {
        $userId = user()->id;
        $progressModel = new Progress();

        // AMBIL DATA HARI INI
        $today = date('Y-m-d');

        $todayProgress = $progressModel
            ->where('id_user', $userId)
            ->where('DATE(tanggal_gabung)', $today)
            ->first();

        $hadirHariIni = $todayProgress ? $todayProgress['hadir'] : 0;

        // AMBIL SEMUA DATA PROGRESS
        $analitik = $progressModel
            ->select('progress.*, kelas.nama_kelas')
            ->join('kelas', 'kelas.id = progress.id_kelas')
            ->where('progress.id_user', $userId)
            ->orderBy('progress.id', 'ASC')
            ->findAll();