app/Controllers/KelasController.php

    public function EnrollKelas($id_kelas){
        $data = $this->request->getVar();
        $newKelas = $this->DetailKelas->insert([
            'id_kelas' => $id_kelas ,
            'id_user' => $data['user_id'] ,
            'tanggal_masuk' => $data['tanggal_masuk']
        ]);
---
INSERT INTO `detail_kelas` (`id_kelas`, `id_user`, `tanggal_masuk`) VALUES ('2', '8', '2025-12-03')